// Author: Vicente Neto
// Date: 02/26/2026
// This query should be executed when you are searching for phishing attempts that try to deceive users by using a VIP name.
// For example, if your name is "Jesus Mary Joseph", the query will split the name into parts and alert you if attackers 
// attempt to forge the message with one of these DisplayNames: Jesus Mary, Jesus Joseph.
// You can automate a list of legitimate senders by using another Watchlist together with Azure Logic Apps, 
// which will help reduce the number of false positives.

let DisplayNames = _GetWatchlist('$WatchListAlias')
    | project DisplayName;
let FinalNames = DisplayNames
    | extend NameParts = split(DisplayName, " ")
    | extend FirstName = NameParts[0]
    | mv-expand AdditionalName = array_slice(NameParts, 1, array_length(NameParts))
    | project NewName = strcat(FirstName, " ", AdditionalName);
EmailEvents
| where SenderDisplayName has_any (FinalNames) or SenderDisplayName has_any (DisplayNames)
| project
    TimeGenerated,
    NetworkMessageId,
    SenderFromAddress,
    SenderDisplayName,
    Subject,
    RecipientEmailAddress,
    DeliveryLocation